In [1]:
# Import neccessary Libraries
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings("ignore")

In [2]:
# Import Dataset
dataset = pd.read_csv('Data.csv')

In [3]:
# Applying one-hot encoading
dataset = pd.get_dummies(dataset,drop_first=True)
dataset

    Age   Salary  Country_Germany  Country_Spain  Purchased_Yes
0  44.0  72000.0            False          False          False
1  27.0  48000.0            False           True           True
2  30.0  54000.0             True          False          False
3  38.0  61000.0            False           True          False
4  40.0      NaN             True          False           True
5  35.0  58000.0            False          False           True
6   NaN  52000.0            False           True          False
7  48.0  79000.0            False          False           True
8  50.0  83000.0             True          False          False
9  37.0  67000.0            False          False           True

In [4]:
# Finding any null values in the dataset
dataset.isnull().sum()

Age                1
Salary             1
Country_Germany    0
Country_Spain      0
Purchased_Yes      0
dtype: int64

In [5]:
# Applying mean values to null
dataset["Salary"].fillna(dataset["Salary"].mean(),inplace=True)
dataset["Age"].fillna(dataset["Age"].mean(),inplace=True)
dataset

         Age        Salary  Country_Germany  Country_Spain  Purchased_Yes
0  44.000000  72000.000000            False          False          False
1  27.000000  48000.000000            False           True           True
2  30.000000  54000.000000             True          False          False
3  38.000000  61000.000000            False           True          False
4  40.000000  63777.777778             True          False           True
5  35.000000  58000.000000            False          False           True
6  38.777778  52000.000000            False           True          False
7  48.000000  79000.000000            False          False           True
8  50.000000  83000.000000             True          False          False
9  37.000000  67000.000000            False          False           True

In [6]:
# To check the null values are correctly applied or if any other null values are there
dataset.isnull().sum()

Age                0
Salary             0
Country_Germany    0
Country_Spain      0
Purchased_Yes      0
dtype: int64

In [7]:
# Checking the column type
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Age              10 non-null     float64
 1   Salary           10 non-null     float64
 2   Country_Germany  10 non-null     bool
 3   Country_Spain    10 non-null     bool
 4   Purchased_Yes    10 non-null     bool
dtypes: bool(3), float64(2)
memory usage: 322.0 bytes

In [8]:
# Changing the columns type to corresponding data type
dataset['Age'] = dataset['Age'].astype('int64')
dataset['Salary'] = dataset['Salary'].astype('int64')
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Age              10 non-null     int64
 1   Salary           10 non-null     int64
 2   Country_Germany  10 non-null     bool
 3   Country_Spain    10 non-null     bool
 4   Purchased_Yes    10 non-null     bool
dtypes: bool(3), int64(2)
memory usage: 322.0 bytes

In [9]:
dataset.describe()

             Age        Salary
count  10.000000     10.000000
mean   38.700000  63777.700000
std     7.257946  11564.099408
min    27.000000  48000.000000
25%    35.500000  55000.000000
50%    38.000000  62388.500000
75%    43.000000  70750.000000
max    50.000000  83000.000000

In [10]:
# Segrigate Quan & Qual columns
qual=[]
quan=[]
for columnname in dataset.columns:
    if (dataset[columnname].dtype =='int64'):
        quan.append(columnname)
    else:
        qual.append(columnname)

In [11]:
quan

['Age', 'Salary']

In [12]:
qual

['Country_Germany', 'Country_Spain', 'Purchased_Yes']

In [13]:
# Mean, Median, Mode should frame as a column and want display the data like as a table format of structure, so using DataFrame function
desc = pd.DataFrame(index=["Mean","Median","Mode"])
desc

Empty DataFrame
Columns: []
Index: [Mean, Median, Mode]

In [14]:
desc = pd.DataFrame(index=["Mean","Median","Mode"],columns=quan)
desc

        Age Salary
Mean    NaN    NaN
Median  NaN    NaN
Mode    NaN    NaN

In [15]:
def central_tendancy(dataset,quan):
    desc = pd.DataFrame(index=["Mean","Median","Mode"],columns=quan)
    for columnname in quan:
        desc[columnname]["Mean"] = dataset[columnname].mean()
        desc[columnname]["Median"] = dataset[columnname].median()
        desc[columnname]["Mode"] = dataset[columnname].mode()[0]
        return desc

In [16]:
central_tendancy(dataset,quan)

         Age Salary
Mean    38.7    NaN
Median  38.0    NaN
Mode      38    NaN